# WoodPoreType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodPoreType Property
AdvancedWood Class See Also
---
The property labeled "Pore type" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodPoreType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodPoreType As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodPoreType {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WoodPoreType".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace